// 3.1
// Ans = 82  => console.log(calculateTotal(testItem, {}));
// Ans = 77  => console.log(calculateTotal(testItem, { shipping: 0 }));
// Ans = 24.25  => console.log(calculateTotal(testItem, { discount: 0.75 }));
// Ans = 89  => console.log(calculateTotal(testItem, { shipping: 12 }));

// 3.2
// ความแตกต่างของทั้ง2ชุด คือ ชุดเเรกจะนำ total ที่เป็น result มาทำการคำนวณเป็นลำดับขั้นเรื่อยๆ
// ซึ่งชุด2 จะเป็นการคำนวณเก็บเป็นตัวแปรแยกต่างหาก และจึงนำมาคำนวณresultในตอนท้าย

// 3.3
// Coding1
// ข้อดี
// 1. ไม่ต้องประกาศตัวแปรถ้าไม่จำเป็น
// ข้อเสีย
// 1. ถ้าในอนาคตมีตัวแปรอื่นที่จะต้องมาใช้ในการคำนวณจะต้องเช็คลำดับขั้นดีๆ
// 2. ถ้ามีคนอื่นต้องมาimplementต่อ จะเข้าใจยากกว่า
// 3. แยกlogic result หลายที่
// Coding2
// ข้อดี
// 1. มีการประกาศตัวแปร และ สัดส่วนการคำนวณที่ชัดเจน เพื่อนำมาใช้ในการคำนวณresultตอนสุดท้ายเพียงครั้งเดียว
// 2. human read
// 3. ถ้าในอนาคตมีตัวแปรอื่นที่จะต้องมาใช้ในการคำนวณจะต้องเช็คลำดับขั้นดีๆ
